say/app/views/submissions/show.html.erb

SELECT  1 AS one FROM "documents"  WHERE "documents"."user_id" = $1 LIMIT 1  [["user_id", 7]]
SELECT "documents".* FROM "documents"  WHERE "documents"."user_id" = $1  [["user_id", 7]]
---
</div>
  <% button_classes = if @user.documents.any? then 'btn btn-lg btn-success' else 'btn btn-lg btn-success bottom-margin' end %>

SELECT  1 AS one FROM "artworks"  WHERE "artworks"."user_id" = $1 LIMIT 1  [["user_id", 7]]
SELECT "artworks".* FROM "artworks"  WHERE "artworks"."user_id" = $1  [["user_id", 7]]
---
<%= link_to 'Upload Artwork', new_artwork_path, class: 'btn btn-lg btn-primary' %>
<% if @user.artworks.any? %>