say/app/controllers/artworks_controller.rb

  def new
    if current_user.artworks.count < Artwork::MAX_ARTWORKS
---
SELECT COUNT(*) FROM "artworks"  WHERE "artworks"."user_id" = $1  [["user_id", 7]]

  def create
    @artwork = current_user.artworks.new(artwork_params)
    @artwork.save
---
INSERT INTO "artworks" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-20 22:49:28.975524"], ["title", "Volta"], ["updated_at", "2014-12-20 22:49:28.975524"], ["user_id", 7]]

  def update
    @artwork.update(artwork_params)
---
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = 9  [["title", "Volta Photo"], ["updated_at", "2014-12-21 00:36:02.823623"]]

  def destroy
    @artwork.destroy
---
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]

    def set_artwork
      @artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks"  WHERE "artworks"."id" = $1 LIMIT 1  [["id", 9]]