say/app/controllers/documents_controller.rb

SELECT COUNT(*) FROM "documents"  WHERE "documents"."user_id" = $1  [["user_id", 7]]
---
  def new
    if current_user.documents.count < Document::MAX_DOCUMENTS

INSERT INTO "documents" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-19 06:08:08.182203"], ["title", "Arts Intensive Story"], ["updated_at", "2014-12-19 06:08:08.182203"], ["user_id", 7]]
---
  def create
    @document = current_user.documents.new(document_params)
    @document.save

UPDATE "documents" SET "title" = $1, "updated_at" = $2 WHERE "documents"."id" = 14  [["title", "Alcatraz 3"], ["updated_at", "2014-12-20 21:45:50.252556"]]
---
  def update
    @document.update(document_params)

DELETE FROM "documents" WHERE "documents"."id" = $1  [["id", 7]]
---
  def destroy
    @document.destroy